org/archive/blog.org_archive
#    -*- mode: org -*-

** TODO Principled Design
:PROPERTIES:
:EXPORT_FILE_NAME: comp-arch
:END:
#+begin_quote
Architecture based upon 'principle', not upon 'precedent'.
-Frank Lloyd Wright
#+end_quote

The role of a computer architect is to
+ look backward — analyze and evaluate the past
+ look forward — evaluate new design choices
+ look up — develop architectures to solve important problems
+ look down — understand, predict and enable the underlying technology

Levels of transformation create /abstractions/, a higher level only needs to know about the interface to the lower level, not how its implemented. *But* knowing about the lower levels allows for making better design and optimization decisions.

   

   
   

   
   
