content/notes/comp-arch.md
+++
title = "Principled Design"
author = ["Prashant Tak"]
lastmod = 2022-12-09T21:10:09+05:30
draft = true
creator = "Emacs 28.2 (Org mode 9.6 + ox-hugo)"
+++

<div class="epigraph">

Architecture based upon 'principle', not upon 'precedent'.

<div class="epicite">

-Frank Lloyd Wright

</div>

</div>

The role of a computer architect is to

-   look backward — analyze and evaluate the past
-   look forward — evaluate new design choices
-   look up — develop architectures to solve important problems
-   look down — understand, predict and enable the underlying technology

Levels of transformation create _abstractions_, a higher level only needs to know about the interface to the lower level, not how its implemented. **But** knowing about the lower levels allows for making better design and optimization decisions.
